<?php

namespace Ace\Controller;

use Plume\Controller;
use Aec\Model\User;
use Plume\Response;

class InitController extends Controller
{
	public function indexAction()
    {
        for ($i=0; $i<100; $i++) {
            try {
                $user = new \Ace\Model\User;
                $user->username = $this->getRndWords('', 3);
                $user->password = '123456';
                $user->save();
            } catch (\Exception $e) {
                return new Response();
            }
        }

        return new Response();
	}
	private function getRndWords( $giveStr="", $num=18 ){  
    $str     = "北京澜声科技有限公司的主要产品是听见啦金玉良缘冰清玉洁继往开来锦绣山河冰雪聪明功成名就桃花潭水深千尺不及汪伦送我情先帝创业未半而中道今天下三分益州疲弊此诚危急存亡之秋也然侍卫之臣不懈于内忠志之士忘身于外者盖追先帝之殊遇欲报之于陛下也诚宜开张圣听剽郡邑势张甚分巡诸佥事偁欲以属公捕而难发言公奋请身任之乃设方畧悬赏格以授三老穷其窟旬日而得酋首并馀党百二十人人以为神满三载迁湖广黄州府同知当发其吏民以十家酾酒道傍泣称觞公为人人釂遂歩至舟贻书谢父老父老相率勒之石诸生追送至建宁乃别抵严陵而提督浙江学校之命下其官佥事公归拜太夫人已娶今张夫人仅八日而奉太夫人之浙既履任岁周行郡邑必徧大较以正文体端士习为先他务钩棘晦僻以相高者虽名士弗录既唱诸生第人人为语所以甲乙故即见斥者得自名而后折之不得已而施檟楚示惨然色诸生人人退自快服也御史礼公修浙通志垂成而有以势强之伸屈者公毅然不可乃废第业具草遂为后志张本三载改提督江西学校其官副使所摹画一如视浙江时而加详密公所称良知学本故王文成公守仁而文成于江西最显著自公推行之且像文成而祀焉其地遂有生像公以祀者前后两省试偕计士所登式半公造第一人而他亦无不优等其后服官政中外践台省以政术名者比比吏部初拟荐公尚宝卿国子司业太常少卿俱不果最后以皇太子出阁妙选官属公为司经局洗马兼翰林侍读以四品服俸居职公之初至江西也时相夏文愍公言群从子姓有欲幸进者公面掷之曰乃公居座主以而曹属我诲不以而曹属我进也夏公闻之不悦故于初宫宷选不及公而言官有所指列夺而属之吏部许文简公讃采物情得公遂以公应公去国十年矣而赐环盖犹未强仕属承华政稍简得以其暇与故邹文庄公守益罗文恭公洪先郑端简公晓赵中丞时春唐中丞顺之軰相琢劘为圣学益切俄而太夫人捐馆公哀毁骨立悉屏谢时俗尚以古礼行之三载不御内是时太夫人得请赐祭官为塟矣甫服除进国子祭酒未上上再问公何以迟迟意盖有属也公之为祭酒下令诸生满而厯事他曹者必以久次毋得用贵人居间置籍以稽膳银之数谓典籍曰吾代汝弭谤也复为籍籍诸生之淑慝使月朔廷诵之以吉服受淑籍素服受慝籍曰忝在师长毋所逃若慝也诸生人人相戒勉二籍矣久之擢礼部右侍郎遂迁吏部乃榜于壁曰咄汝阶二十一而及第四十三而佐天官国恩厚矣何以称塞所不竭忠殚劳而或植党以摈贤或殉贿而鬻法或背公以行媚或持禄以自营神之殛之及于子孙吁可畏哉故事吏部大僚鐍车门所接见庶官不能得数语以示严冷公曰若尔何以能尽人才也乃痛折节修辞色而下之见必深坐亹亹谘访吏治民瘼遐陬幽蔀因以窥见其人顾见者亦自喜得少宰心愿为之用公益有搢绅问声以为恒太宰熊恭肃公浃雅重公自以得共事晩公亦不复守循默辙相与励亷节奨恬退振淹滞抑奔竞一时翕然归称于熊公而会熊公以直谏忤旨去唐文襄及吾郡周恭肃公用相继之二公重公不异熊公而又老多病公数奉旨署部事当是时有行重宝贿方士求大司马者取上指胁公至再皆弗应后其人为大帅竟坐败绩抵罪而公所推毂宋庄靖公景张襄惠公岳王文定公道欧阳文庄公及范大司马鏓皆天下所共信以为长者大计吏公复代周公司之尤能于毁誉外定去留亡论留者即去者亦心服亡敢望周公卒公推闻庄简公渊闻公耉老人以为非上所急公弗顾也闻公入未几公改兼翰林院学士诲庶吉士公虽名不废课习而脱去所谓骈俪帖括之旧推所真得于身心者訾娓说之又间朂以国典民事其后多卓然及公世而称名臣咸归公善诱功公满三品考录璠入太学逾年掌翰林院事复充会典副总裁会典虽再更定而事由诸曹草创往往相矛盾上即位后数兴革大礼礼官不胜绵蕞公始为创义例挈纲领井然一代程书久之廷推公入内阁不果寻擢礼部尚书学士如故疏辞温旨不允礼部之为政者久好以寛大养弊至公而肃然更始凡王国爵封秩谥并文武大臣陈乞祭塟公皆衷之以请报可定为洁令其考诸蕃通事太医诸生皆为裁画一即猾吏有拱手受而已时庄敬皇太子冠公受命赞冠甫成礼而暴疾薨公当议丧礼以上及百官皆为朞之服百官仍诣门哭上不怿谓天子绝朞不制服其百官服可无诣门哭临礼著诣停柩所辅臣读至服可无而句之曰以青衣角带往可也公曰不然绝朞者天子也非百官也曰可无诣门而已非可无服也且未有哭临而不衰服者定议以齐衰服临上使中涓詗而是之令宫中仍皆服衰公遂为庄敬册谥副使已命题主上察公慎勤又有所应制文字独多称旨召入直无逸殿庐给供馔如例寻赐飞鱼服公遂请立皇太子不报自是连上疏请之又与同直四臣请之皆不报盖次当继庄敬而立者裕王是为穆宗而景王与同岁差少中外未测上指所向公恐有钓竒者故请之亟最后当冠因而及婚礼若开讲公复请以齿叙先裕而后景复不允既冠公赞景王冠偕诸大臣谒于临保室上使中涓问二王行坐何若公曰有上黼座在坐则俱向西可也行则遵伦序且祖训严谁敢紊之毋何诏二王婚俱出就外邸公手疏言臣过虑有二端王邸隔仅一墙耳名位既不别而■〈执上目下御均众能保无阋声以上尘雍睦之听又往者九重之内有慈庆有神寜有鹤禁而后人主之势沉沉今者仅二王耳而悉就外邸臣不能不为陛下寒心也复畹中万寿节推恩加太子太保北兵阑入塞遂薄都城时事出仓卒中外汹汹公念诸营皆子侯无可将者亟请赦诸边将在廷尉狱若戴纶李珍軰复其官俾诣行营自效报可复手疏请上还大内亟召群臣面计兵事上褒公忠爱而尚难还内召群臣时内阁推公督视九门公亦慷慨请行上倚公左右自安故特用其副王少宰邦瑞而谕公意焉会有中涓陷敌归者以敌求贡书闻云不许我则进兵上以示公及辅臣分宜公嵩等且召对便殿上顾谓当何处分宜对曰敌饥困不足患公曰敌万众薄城剽杀人若刈菅尚何论饥急谋所以御之耳上顾曰善复问敌求贡书安在分宜出诸袖中曰礼部事也上复顾公公曰敌重且深矣不许恐激之怒许则彼逞而厚要我上曰苟利社稷珠玉皮币何爱焉公曰事有甚于珠玉皮币者陛下所不能受则柰何上悚然曰卿虑之逺虽然当何处公曰请计缓之上曰何谓缓公曰遣译者至营而诘之以无畨文故且徵其情实实则令暂出边用前岁成例贡马行赏互市往返少日我城中之备完而援兵日益集敌且退不退我从而拒之可十全上称善者再分宜乃进曰上幸出一视朝上不答公从傍臾之上曰可尔得无遽耶公曰敌兵薄城下人心惴惴倚陛下而重得一跸声若亢旱之得雷霆宁骤也上始首肯公出而会廷臣议皆言求贡非本情不可许公因兼酌所以面请者疏闻而上果视朝申饬中外甚厉会勤王兵四集敌亦饱且去乃下公疏不许贡时聂贞襄公以副使为民都御史何公栋久废公疏荐其才即用之上又密谘公善后策公言营兵久朘而得弱今欲转之强宜责新帅鸾京城楼橹废守兵懈向者幸敌自退耳宜责督臣邦瑞及定西侯傅前敌以边备弛得阑入宜以严候火治亭障责新抚镇勤王兵独延绥卒可留今疲矣宜恤诸道募兵者皆文臣预选而不预战宜参之一二亷将得敌情毋如用谍用谍毋如大同宜增选上皆虚已听焉时以诺延三卫我外藩而导敌入境集贡使显责之公谓事虚实未可知显责之虚则彼愤而自疑实则彼罪不赦将显叛我而我不能讨是驱使就敌也不若责之以捍圉不虔使彼易受而后抚之众咸服公念敌外讧纲纪内溃天下事且不支而上待我厚不忍负之旣以召见拄分宜公口至是益发舒亡所顾公之用雅非分宜意而前是太宰缺廷推公当补上犹怒之谓方侍朕左右何辄拟外迁见以为旦夕且大拜南床缘分宜指饰他事有所苛掷上不听益厚公分宜厕亡以间之且愧惧而孝烈袝太庙之议起初孝烈皇后崩上欲祔之庙而念压于先孝洁皇后又睿考入太庙非中外公论恐千秋万岁后所祧主或非仁宗而睿考遂下公定议欲以孝烈先祔公合诸大臣议朝房大约以女后无先入庙者请祀之奉先殿时诸公相顾莫敢应独礼科都给事中杨思忠以为然疏上上大怒谓公与思忠专之足矣何诸臣为令再议公不获已乃小婉其辞以为太庙九室皆满若以今上论仁宗固在所当祧苐此乃他日圣子神孙之事而仰烦皇上身自议之臣等愈有不安于心者夫夏庙五商庙七周庙九今更逓益之于太庙奉先殿各增二室而升祔孝烈皇后则仁宗不必祧而孝烈可速祔上难于增二庙谓公故设难以阻之愈怒促更议祧仁宗祔孝烈所以督责公甚峻公虽不获终守前说然天下信其为正上后于元旦摘杨君表误杖之百而氓之冀以警公分宜因遂谓公可撼锋距百出公坦然而已时大帅鸾骤有宠利诺延之弱欲掩之以为功谓其实导敌请发兵征之下公与兵部议公曰征之易耳一征而永撤我百八十年之藩篱且侯鸾所谓导谙达者即得之谙达所夫安知谙达之不利其土沃而假手我也我得其地不能戍将毋为敌外囿何乃弗果徵佥事赵时春以山东募卒入卫颇精侯鸾恶而欲并之谓赵君暴且贰流言渐狎闻公挟缇帅炳出犒所以慰谕有加归语中贵人福俾婉曲白之上乃又弗果并侯鸾虽内衔公苐时方与分宜争权相构不暇也而会偕蓟帅有获间功上复下公及兵部议侯鸾分宜軰俱获上赏乃仅录公一子入胄监而上特手注加公少保分宜为恍然自失久之寻兼东阁大学士参预机务仍掌礼部事候代者";# 字库  
    $newStr  = "";       # 随机生成的包含答案的字符串  
    $anLo    = array();  # 设定的答案所在的位置。  
    $bit     = 3;        # 位数，在本系统中是utf-8编码，一个中文长度为3  
    $anLenth = floor(strlen($giveStr)/$bit); # 答案长度,在UTF编码中，  
      
    # 这些汉字在18个汉字中的位置  
    $i = 0;  
    while ( $i<$anLenth ) {  
        $rd = rand( 0, $num-1 );  
        if(in_array($rd,$anLo)) continue; # 保证了不重复。  
        $anLo[] = $rd;  
        $i++;  
    }  
      
    for( $j=0; $j<$num;$j++ ){  
        if(in_array($j,$anLo)){  
            $k = array_search($j,$anLo);  
            $newStr .= mb_substr($giveStr,$k*$bit,$bit);  
              
        } else {  
            $rd  = rand(0,(strlen($str)-1)/$bit);  
            $wd  = mb_substr($str,$rd*$bit,$bit);  
            $str = str_replace($wd, '', $str);  
            $newStr .= $wd;  
        }  
		}  
    return (strlen($newStr) < 1 or strlen($newStr) > 9) ? $this->getRndWords($giveStr, $num) : $newStr;
	}

	public function aAction()
    {
        $redis = new \Redis();
        try {
            $redis->ping();
        } catch (\Exception $e) {
            $redis->connect('127.0.0.1');
        }
        dump($redis->ping());
        return new  Response();
    }
}
